VatEngine/test2_bl_to_bl.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?><?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?><iVATEngineInput><Supplier><ID>21535</ID><Name>BECOMPANY NV</Name><Address>TOEKOMSTSTRAAT 10</Address><ZIP>2000</ZIP><City>ANTWERPEN</City><Country>BE</Country><RegOfCommerce></RegOfCommerce><BancAccountNumber></BancAccountNumber><IBAN></IBAN><BIC></BIC><TelephoneNumber></TelephoneNumber><FaxNumber></FaxNumber><EmailAddress></EmailAddress><SpecialType>0</SpecialType><DeductionType>0</DeductionType><VATNumberSupplier Country="BE"><VATNumber>BE0686731303</VATNumber><VATNumberType>1</VATNumberType><Name></Name><Address1></Address1><Address2></Address2><Address3></Address3><TaxNumber></TaxNumber><BelongsToFiscalUnit>0</BelongsToFiscalUnit></VATNumberSupplier><CountryChosenVATNumber>BE</CountryChosenVATNumber></Supplier><Customer><ID>21644</ID><Name>BEGOVERNMENT</Name><Address>PRINSENSTRAAT 12</Address><ZIP>9000 </ZIP><City>GENT</City><EmailAddress></EmailAddress><Country>BE</Country><SpecialType>4</SpecialType><TypeOfGoods>0</TypeOfGoods></Customer><InvoiceProperties><DocumentType>0</DocumentType><Disconto>0</Disconto><Currency1>EUR</Currency1><InvoiceNumber>2</InvoiceNumber><ReferenceInvoiceNumber></ReferenceInvoiceNumber><InvoiceDate>2018-06-28</InvoiceDate><OfficialLanguage>1</OfficialLanguage></InvoiceProperties><Item ID="1"><Properties><Description></Description><InternationalDescription LanguageID="1">personenvervoer (land) (-200-)</InternationalDescription><InternationalDescription LanguageID="2">transport de personnes (-200-)</InternationalDescription><InternationalDescription LanguageID="3">transport of persons (land) (-200-)</InternationalDescription><InternationalDescription LanguageID="4">transporte de pasajeros (-200-)</InternationalDescription><InternationalDescription LanguageID="5">personenbeförderung  (-200-)</InternationalDescription><InternationalDescription LanguageID="6">tráfego de passageiros (-200-)</InternationalDescription><InternationalDescription LanguageID="7">trasporto passeggeri (-200-)</InternationalDescription><InternationalDescription LanguageID="10">henkilökuljetus (-200-)</InternationalDescription><InternationalDescription LanguageID="11">persontrafik (-200-)</InternationalDescription><InternationalDescription LanguageID="15">personu parvada?ana (-200-)</InternationalDescription><TaricCode></TaricCode><ItemClassificationCode>200</ItemClassificationCode><CPCCode>6421</CPCCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>100</UnitPriceExclVAT><TotalAmountExclVAT>100</TotalAmountExclVAT><PackagingCosts>0</PackagingCosts></Amounts><Number>1</Number><Unit></Unit><VATRate>6</VATRate><Reduction>0</Reduction><AdditionalProperties><PropertiesPerCountry Country="BE"><VATRateCode>R</VATRateCode></PropertiesPerCountry><EngineParameter1></EngineParameter1><EngineParameter2>AA000A</EngineParameter2><EngineParameter3>A</EngineParameter3></AdditionalProperties><OutOfVAT>0</OutOfVAT></Properties><Conditions><ShipFrom><CountryDeparture>BE</CountryDeparture></ShipFrom><ShipTo><CountryArrival>BE</CountryArrival></ShipTo><ContinuousSupply>0</ContinuousSupply><DateTransaction>2018-06-28</DateTransaction></Conditions><AdditionalMentioning><Text>Het vervoer vertrekt van België naar België. / The transport departs from Belgium and goes to Belgium.</Text></AdditionalMentioning></Item><AmountsSummary CurrencyNumber="1"><VATTotals VATRate="6"><AmountDisconto>0</AmountDisconto><AmountExclVAT>100</AmountExclVAT><AmountVAT>6</AmountVAT></VATTotals><Totals><TotalAmountVAT>6</TotalAmountVAT><TotalAmountInclVAT>106</TotalAmountInclVAT><TotalAmountDisconto>0</TotalAmountDisconto><TotalAmountInclVATCash>106</TotalAmountInclVATCash><TotalAmountPackagingCosts>0</TotalAmountPackagingCosts></Totals></AmountsSummary><CheckValue>100</CheckValue></iVATEngineInput>
	  ]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>